Revit 2024 API
LoadComponent Class
 An object that represents a load combination component.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class LoadComponent : IDisposable
Visual Basic
Public Class LoadComponent _
	Implements IDisposable
Visual C++
public ref class LoadComponent : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.LoadComponent
See Also
LoadComponent Members
Autodesk.Revit.DB.Structure Namespace